javnson/gmp_pro/ctl/suite/mcs_pmsm_id/project/stm32f405/sdpe_mgr/sdpe_mcs_pmsm_id_stm32f405_settings.h
/**
 * @brief Maximum current bias in amperes used for the inductance profile.
 */
#ifndef MCS_PMSM_ID_LDQ_MAX_BIAS_CURRENT_A
#define MCS_PMSM_ID_LDQ_MAX_BIAS_CURRENT_A real2param(5.0)
#endif // MCS_PMSM_ID_LDQ_MAX_BIAS_CURRENT_A

/**
 * @brief Number of bias points recorded for each inductance axis.
 */
#ifndef MCS_PMSM_ID_LDQ_BIAS_STEPS
#define MCS_PMSM_ID_LDQ_BIAS_STEPS (12)
#endif // MCS_PMSM_ID_LDQ_BIAS_STEPS

/**
 * @brief D-axis alignment current in amperes used before inductance pulses.
 */
#ifndef MCS_PMSM_ID_LDQ_ALIGN_CURRENT_A
#define MCS_PMSM_ID_LDQ_ALIGN_CURRENT_A real2param(5.0)
#endif // MCS_PMSM_ID_LDQ_ALIGN_CURRENT_A

/**
 * @brief Bias-current settling time in seconds before each inductance pulse.
 */
#ifndef MCS_PMSM_ID_LDQ_SETTLE_TIME_S
#define MCS_PMSM_ID_LDQ_SETTLE_TIME_S real2param(0.2)
#endif // MCS_PMSM_ID_LDQ_SETTLE_TIME_S

/**
 * @brief Inductance voltage-pulse duration in seconds.
 */
#ifndef MCS_PMSM_ID_LDQ_PULSE_TIME_S
#define MCS_PMSM_ID_LDQ_PULSE_TIME_S real2param(0.002)
#endif // MCS_PMSM_ID_LDQ_PULSE_TIME_S

/**
 * @brief Zero-voltage cooldown time in seconds between inductance pulses.
 */
#ifndef MCS_PMSM_ID_LDQ_COOLDOWN_TIME_S
#define MCS_PMSM_ID_LDQ_COOLDOWN_TIME_S real2param(0.05)
#endif // MCS_PMSM_ID_LDQ_COOLDOWN_TIME_S

/**
 * @brief Enable PM flux-linkage identification.
 */
#ifndef MCS_PMSM_ID_ENABLE_FLUX
#define MCS_PMSM_ID_ENABLE_FLUX (1)
#endif // MCS_PMSM_ID_ENABLE_FLUX

/**
 * @brief Minimum mechanical speed in rpm used by the flux-linkage regression.
 */
#ifndef MCS_PMSM_ID_FLUX_MIN_SPEED_RPM
#define MCS_PMSM_ID_FLUX_MIN_SPEED_RPM real2param(300.0)
#endif // MCS_PMSM_ID_FLUX_MIN_SPEED_RPM

/**
 * @brief Maximum mechanical speed in rpm used by the flux-linkage regression.
 */
#ifndef MCS_PMSM_ID_FLUX_MAX_SPEED_RPM
#define MCS_PMSM_ID_FLUX_MAX_SPEED_RPM real2param(1800.0)
#endif // MCS_PMSM_ID_FLUX_MAX_SPEED_RPM

/**
 * @brief Number of speed points used by the flux-linkage regression.
 */
#ifndef MCS_PMSM_ID_FLUX_STEPS
#define MCS_PMSM_ID_FLUX_STEPS (6)
#endif // MCS_PMSM_ID_FLUX_STEPS

/**
 * @brief Current magnitude in amperes used for I/F flux-linkage rotation.
 */
#ifndef MCS_PMSM_ID_FLUX_IF_CURRENT_A
#define MCS_PMSM_ID_FLUX_IF_CURRENT_A real2param(4.0)
#endif // MCS_PMSM_ID_FLUX_IF_CURRENT_A

/**
 * @brief Settling time in seconds at each flux-identification speed.
 */
#ifndef MCS_PMSM_ID_FLUX_SETTLE_TIME_S
#define MCS_PMSM_ID_FLUX_SETTLE_TIME_S real2param(2.0)
#endif // MCS_PMSM_ID_FLUX_SETTLE_TIME_S

/**
 * @brief Number of ISR samples averaged at each flux-identification speed.
 */
#ifndef MCS_PMSM_ID_FLUX_MEASURE_POINTS
#define MCS_PMSM_ID_FLUX_MEASURE_POINTS (2000)
#endif // MCS_PMSM_ID_FLUX_MEASURE_POINTS

/**
 * @brief Enable the sensored constant-Iq acceleration and PWM-off coast-down mechanical identification stage.
 */
#ifndef MCS_PMSM_ID_ENABLE_MECHANICAL_ID
#define MCS_PMSM_ID_ENABLE_MECHANICAL_ID (1)
#endif // MCS_PMSM_ID_ENABLE_MECHANICAL_ID

/**
 * @brief User-selected mechanical target speed in rpm for the identification test.
 */
#ifndef MCS_PMSM_ID_MECH_TARGET_SPEED_RPM
#define MCS_PMSM_ID_MECH_TARGET_SPEED_RPM real2param(1000.0)
#endif // MCS_PMSM_ID_MECH_TARGET_SPEED_RPM

/**
 * @brief User-selected q-axis current in amperes applied by the real current loop during acceleration.
 */
#ifndef MCS_PMSM_ID_MECH_ACCEL_CURRENT_A
#define MCS_PMSM_ID_MECH_ACCEL_CURRENT_A real2param(1.0)
#endif // MCS_PMSM_ID_MECH_ACCEL_CURRENT_A

/**
 * @brief Lower acceleration/coast fitting boundary relative to the selected target speed.
 */
#ifndef MCS_PMSM_ID_MECH_FIT_LOW_RATIO
#define MCS_PMSM_ID_MECH_FIT_LOW_RATIO real2param(0.30)
#endif // MCS_PMSM_ID_MECH_FIT_LOW_RATIO

/**
 * @brief Upper acceleration/coast fitting boundary relative to the selected target speed.
 */
#ifndef MCS_PMSM_ID_MECH_FIT_HIGH_RATIO
#define MCS_PMSM_ID_MECH_FIT_HIGH_RATIO real2param(0.70)
#endif // MCS_PMSM_ID_MECH_FIT_HIGH_RATIO

/**
 * @brief Target-speed ratio at which PWM is physically disabled to start free coast-down.
 */
#ifndef MCS_PMSM_ID_MECH_PWM_OFF_RATIO
#define MCS_PMSM_ID_MECH_PWM_OFF_RATIO real2param(0.75)
#endif // MCS_PMSM_ID_MECH_PWM_OFF_RATIO

/**
 * @brief Safety timeout in seconds covering acceleration and free coast-down.
 */
#ifndef MCS_PMSM_ID_MECH_MAX_TEST_TIME_S
#define MCS_PMSM_ID_MECH_MAX_TEST_TIME_S real2param(20.0)
#endif // MCS_PMSM_ID_MECH_MAX_TEST_TIME_S

/**
 * @brief Expected maximum combined duration of the two recorded 30%-70% speed curves.
 */
#ifndef MCS_PMSM_ID_MECH_RECORD_TIME_S
#define MCS_PMSM_ID_MECH_RECORD_TIME_S real2param(10.0)
#endif // MCS_PMSM_ID_MECH_RECORD_TIME_S

/**
 * @brief Minimum coefficient of determination accepted for acceleration-versus-speed regression.
 */
#ifndef MCS_PMSM_ID_MECH_MIN_FIT_R2
#define MCS_PMSM_ID_MECH_MIN_FIT_R2 real2param(0.80)
#endif // MCS_PMSM_ID_MECH_MIN_FIT_R2

/**
 * @brief Minimum differentiated samples required in each acceleration and coast curve.
 */
#ifndef MCS_PMSM_ID_MECH_MIN_FIT_SAMPLES
#define MCS_PMSM_ID_MECH_MIN_FIT_SAMPLES (30)
#endif // MCS_PMSM_ID_MECH_MIN_FIT_SAMPLES

/**
 * @brief Enable the seven ADC slots used by the PMSM SIL input ABI.
 */
#ifndef GMP_PIL_RX_MASK
#define GMP_PIL_RX_MASK (127)
#endif // GMP_PIL_RX_MASK

/**
 * @brief Enable three PWM slots and six monitor slots used by the PMSM SIL output ABI.
 */
#ifndef GMP_PIL_TX_MASK
#define GMP_PIL_TX_MASK (4128775)
#endif // GMP_PIL_TX_MASK

/**
 * @brief
 */
#ifndef MCS_MIN_DC_BUS_VOLTAGE_V
#define MCS_MIN_DC_BUS_VOLTAGE_V (CTRL_DCBUS_VOLTAGE*0.2f)
#endif // MCS_MIN_DC_BUS_VOLTAGE_V

//=================================================================================================
/**
 * @brief Common fallbacks: GMP Suite PIL Common Transport.
 */

//=================================================================================================
/**
 * @brief PIL Runtime.
 */

/**
 * @brief Run control steps only from Data Link PIL transactions while physical control dispatch and power-stage enable remain isolated.
 */
// #ifndef ENABLE_GMP_DL_PIL_SIM
// #define ENABLE_GMP_DL_PIL_SIM
// #endif // ENABLE_GMP_DL_PIL_SIM

//=================================================================================================
/**
 * @brief Requirement bindings.
 */

/**
 * @brief Base command followed by mask, step, status, and abort subcommands.
 */
#ifndef GMP_PIL_DL_BASE_COMMAND
#define GMP_PIL_DL_BASE_COMMAND (16)
#endif // GMP_PIL_DL_BASE_COMMAND

/**
 * @brief Portable commissioning rate used unless a hardware project overrides it.
 */
#ifndef GMP_DL_UART_BAUDRATE
#define GMP_DL_UART_BAUDRATE (115200)
#endif // GMP_DL_UART_BAUDRATE

/**
 * @brief Host running Simulink and the GMP PIL bridge.
 */
#ifndef GMP_PIL_UDP_HOST
#define GMP_PIL_UDP_HOST "127.0.0.1"
#endif // GMP_PIL_UDP_HOST

/**
 * @brief Bridge port receiving plant samples from Simulink.
 */
#ifndef GMP_PIL_BRIDGE_UDP_LISTEN_PORT
#define GMP_PIL_BRIDGE_UDP_LISTEN_PORT (12501)
#endif // GMP_PIL_BRIDGE_UDP_LISTEN_PORT

/**
 * @brief Simulink port receiving controller results from the bridge.
 */
#ifndef GMP_PIL_MATLAB_UDP_LISTEN_PORT
#define GMP_PIL_MATLAB_UDP_LISTEN_PORT (12500)
#endif // GMP_PIL_MATLAB_UDP_LISTEN_PORT

/**
 * @brief Bridge port receiving out-of-band Simulink commands.
 */
#ifndef GMP_PIL_MATLAB_COMMAND_TX_PORT
#define GMP_PIL_MATLAB_COMMAND_TX_PORT (12502)
#endif // GMP_PIL_MATLAB_COMMAND_TX_PORT

/**
 * @brief Simulink port receiving command acknowledgements.
 */
#ifndef GMP_PIL_MATLAB_COMMAND_RX_PORT
#define GMP_PIL_MATLAB_COMMAND_RX_PORT (12503)
#endif // GMP_PIL_MATLAB_COMMAND_RX_PORT

/**
 * @brief Maximum wait for one target Data Link response.
 */
#ifndef GMP_PIL_MCU_TIMEOUT_MS
#define GMP_PIL_MCU_TIMEOUT_MS (200)
#endif // GMP_PIL_MCU_TIMEOUT_MS

/**
 * @brief Maximum wait for the next Simulink plant sample.
 */
#ifndef GMP_PIL_MATLAB_TIMEOUT_MS
#define GMP_PIL_MATLAB_TIMEOUT_MS (5000)
#endif // GMP_PIL_MATLAB_TIMEOUT_MS

/**
 * @brief Digital input slot packed into the standard Data Link PIL request.
 */
#ifndef GMP_PIL_UDP_DIGITAL_INDEX
#define GMP_PIL_UDP_DIGITAL_INDEX (0)
#endif // GMP_PIL_UDP_DIGITAL_INDEX

// Common tail code: MCS PMSM Identification Common Control
/* Accept the historical misspelling while all source code uses the canonical switch. */
#if defined ENBALE_GMP_DL_PIL_SIM && !defined ENABLE_GMP_DL_PIL_SIM
#define ENABLE_GMP_DL_PIL_SIM
#endif

/* Reject unsupported incremental build levels at preprocessing time. */
#if (BUILD_LEVEL < 1) || (BUILD_LEVEL > 4)
#error "BUILD_LEVEL must be 1 (V/f), 2 (current loop/synthetic angle), 3 (current loop/encoder), or 4 (speed loop)."
#endif

// Common tail code: GMP Suite PIL Common Transport
/** Validate the shared PIL command allocation. */
#if (GMP_PIL_DL_BASE_COMMAND > 251U)
#error "GMP_PIL_DL_BASE_COMMAND must leave room for four PIL subcommands."
#endif
#if (GMP_PIL_UDP_DIGITAL_INDEX >= 8U)
#error "GMP_PIL_UDP_DIGITAL_INDEX must be in the range [0, 7]."
#endif

// User project tail code
/* Platform-specific peripheral selection and validation. */
#define MCS_PWM_TIMER_HANDLE (&htim1)
#define MCS_PWM_ADC_TRIGGER ADC_EXTERNALTRIGINJEC_T1_TRGO

#ifdef __cplusplus
}
#endif

#endif // _PROJECT_SDPE_MCS_PMSM_ID_STM32F405_SETTINGS_H_
